---
title: LinePatternElement
classe: Autodesk.Revit.DB.LinePatternElement
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# LinePatternElement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `LinePatternElement Create(Document, LinePattern)` | `LinePatternElement.Create(document, linePattern)` | LinePatternElement |
| `LinePattern GetLinePattern(Document, ElementId)` | `LinePatternElement.GetLinePattern(document, elementId)` | LinePattern |
| `LinePattern GetLinePattern()` | `linePatternElement.GetLinePattern()` | LinePattern |
| `LinePatternElement GetLinePatternElementByName(Document, String)` | `LinePatternElement.GetLinePatternElementByName(document, name)` | LinePatternElement |
| `ElementId GetSolidPatternId()` | `LinePatternElement.GetSolidPatternId()` | ElementId |
| `Void SetLinePattern(LinePattern)` | `linePatternElement.SetLinePattern(newLinePattern)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```